; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v1)
		(pred_4 ?v5)
		(pred_1 ?v6)
		(pred_6 ?v6)
		(pred_3 ?v5 ?v6)
		(pred_5)
		(pred_2 ?v5))

   (:action op_3
       :parameters  (?v7 ?v3)
       :precondition (and (not-eq ?v7 ?v3) 
                          (pred_1 ?v7) (pred_1 ?v3) (pred_6 ?v7))
       :effect (and  (pred_6 ?v3)
		     (not (pred_6 ?v7))))


   (:action op_1
       :parameters (?v4 ?v8)
       :precondition  (and  (pred_4 ?v4) (pred_1 ?v8)
			    (pred_3 ?v4 ?v8) (pred_6 ?v8) (pred_5))
       :effect (and (pred_2 ?v4)
		    (not (pred_3 ?v4 ?v8)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v4  ?v8)
       :precondition  (and  (pred_4 ?v4) (pred_1 ?v8)
			    (pred_2 ?v4) (pred_6 ?v8))
       :effect (and (pred_3 ?v4 ?v8)
		    (pred_5)
		    (not (pred_2 ?v4)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_04 obj_03 obj_01 obj_06 obj_02 
          obj_07 obj_05 
)
(:init
(pred_1 obj_04)
(pred_1 obj_03)
(pred_1 obj_01)
(pred_1 obj_06)
(pred_1 obj_02)
(pred_4 obj_07)
(pred_4 obj_05)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(pred_5)
(pred_3 obj_07 obj_01)
(pred_3 obj_05 obj_02)
(pred_6 obj_06)
)
(:goal
(and
(pred_3 obj_07 obj_02)
(pred_3 obj_05 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_07 obj_02) (pred_6 obj_04))
    (sometime-before  (pred_3 obj_05 obj_06) (pred_6 obj_04))
  )
)
)

; plan
1. (op_3 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_01)
   goals met: 0 of 2
2. (op_1 obj_07 obj_01)
   deleted: (pred_3 obj_07 obj_01) (pred_5)
   added: (pred_2 obj_07)
   goals met: 0 of 2
3. (op_3 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_04)
   goals met: 0 of 2
4. (op_2 obj_07 obj_04)
   deleted: (pred_2 obj_07)
   added: (pred_3 obj_07 obj_04) (pred_5)
   goals met: 0 of 2
5. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 0 of 2
6. (op_1 obj_05 obj_02)
   deleted: (pred_3 obj_05 obj_02) (pred_5)
   added: (pred_2 obj_05)
   goals met: 0 of 2
7. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_06)
   goals met: 0 of 2
8. (op_2 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_3 obj_05 obj_06) (pred_5)
   goals met: 1 of 2
9. (op_3 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 1 of 2
10. (op_1 obj_07 obj_04)
   deleted: (pred_3 obj_07 obj_04) (pred_5)
   added: (pred_2 obj_07)
   goals met: 1 of 2
11. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 1 of 2
12. (op_2 obj_07 obj_02)
   deleted: (pred_2 obj_07)
   added: (pred_3 obj_07 obj_02) (pred_5)
   goals met: 2 of 2
